package com.lapsa.country;

public enum Country2 {

    ABW(533, "Аруба", "Aruba"), // Аруба
    AFG(4, "Афганистан", "Afghanistan"), // Афганистан
    AGO(24, "Ангола", "Angola"), // Ангола
    AIA(660, "Ангилья", "Anguilla"), // Ангилья
    ALB(8, "Албания", "Albania"), // Албания
    AND(20, "Андорра", "Andorra"), // Андорра
    ANT(530, "Нидерландские Антилы", "Netherlands Antilles"), // Нидерландские
    // Антилы
    ARE(784, "Объединенные Арабские Эмираты (ОАЭ)", "United Arab Emirates"), // Объединенные
    // Арабские
    // Эмираты
    // (ОАЭ)
    ARG(32, "Аргентина", "Argentina"), // Аргентина
    ARM(51, "Армения", "Armenia"), // Армения
    ASM(16, "Американское Самоа", "American Samoa"), // Американское
						     // Самоа
    ATG(28, "Антигуа и Барбуда", "Antigua and Barbuda"), // Антигуа и
    // Барбуда
    AUS(36, "Австралия", "Australia"), // Австралия
    AUT(40, "Австрия", "Austria"), // Австрия
    AZE(31, "Азербайджан", "Azerbaijan"), // Азербайджан
    BDI(108, "Бурунди", "Burundi"), // Бурунди
    BEL(56, "Бельгия", "Belgium"), // Бельгия
    BEN(204, "Бенин", "Benin"), // Бенин
    BFA(854, "Буркина-Фасо", "Burkina Faso"), // Буркина-Фасо
    BGD(50, "Бангладеш", "Bangladesh"), // Бангладеш
    BGR(100, "Болгария", "Bulgaria"), // Болгария
    BHR(48, "Бахрейн", "Bahrain"), // Бахрейн
    BHS(44, "Багамы", "The Bahamas"), // Багамы
    BIH(70, "Босния и Герцеговина", "Bosnia and Herzegovina"), // Босния
							       // и
    // Герцеговина
    BLM(652, "Сен-Бартельми", "Saint Barthélemy"), // Сен-Бартельми
    BLR(112, "Беларусь", "Belarus"), // Беларусь
    BLZ(84, "Белиз", "Belize"), // Белиз
    BMU(60, "Бермудские острова", "Bermuda"), // Бермудские острова
    BOL(68, "Боливия", "Bolivia"), // Боливия
    BRA(76, "Бразилия", "Brazil"), // Бразилия
    BRB(52, "Барбадос", "Barbados"), // Барбадос
    BRN(96, "Бруней-Даруссалам", "Brunei"), // Бруней-Даруссалам
    BTN(64, "Бутан", "Bhutan"), // Бутан
    BWA(72, "Ботсвана", "Botswana"), // Ботсвана
    CAF(140, "Центральноафриканская Республика (ЦАР)", "Central African Republic"), // Центральноафриканская
    // Республика
    // (ЦАР)
    CAN(124, "Канада", "Canada"), // Канада
    CCK(166, "Кокосовые (Килинг) острова", "Cocos (Keeling) Islands"), // Кокосовые
    // (Килинг)
    // острова
    CHE(756, "Швейцария", "Switzerland"), // Швейцария
    CHL(152, "Чили", "Chile"), // Чили
    CHN(156, "Китай (КНР)", "China"), // Китай (КНР)
    CIV(384, "Кот д’Ивуар", "Cote d’Ivoire"), // Кот д’Ивуар
    CMR(120, "Камерун", "Cameroon"), // Камерун
    COD(180, "Демократическая Республика Конго", "Democratic Republic of the Congo"), // Демократическая
    // Республика
    // Конго
    COG(178, "Конго", "Republic of the Congo"), // Конго
    COK(184, "Острова Кука", "Cook Islands"), // Острова Кука
    COL(170, "Колумбия", "Colombia"), // Колумбия
    COM(174, "Коморы", "Comoros"), // Коморы
    CPV(132, "Кабо-Верде", "Cape Verde"), // Кабо-Верде
    CRI(188, "Коста-Рика", "Costa Rica"), // Коста-Рика
    CUB(192, "Куба", "Cuba"), // Куба
    CXR(162, "Остров Рождества", "Christmas Island"), // Остров
						      // Рождества
    CYM(136, "Каймановы острова", "Cayman Islands"), // Каймановы
						     // острова
    CYP(196, "Кипр", "Cyprus"), // Кипр
    CZE(203, "Чешская Республика", "Czech Republic"), // Чешская
						      // Республика
    DEU(276, "Германия", "Germany"), // Германия
    DJI(262, "Джибути", "Djibouti"), // Джибути
    DMA(212, "Доминика", "Dominica"), // Доминика
    DNK(208, "Дания", "Denmark"), // Дания
    DOM(214, "Доминиканская Республика", "Dominican Republic"), // Доминиканская
    // Республика
    DZA(12, "Алжир", "Algeria"), // Алжир
    ECU(218, "Эквадор", "Ecuador"), // Эквадор
    EGY(818, "Египет", "Egypt"), // Египет
    ERI(232, "Эритрея", "Eritrea"), // Эритрея
    ESP(724, "Испания", "Spain"), // Испания
    EST(233, "Эстония", "Estonia"), // Эстония
    ETH(231, "Эфиопия", "Ethiopia"), // Эфиопия
    FIN(246, "Финляндия", "Finland"), // Финляндия
    FJI(242, "Фиджи", "Fiji"), // Фиджи
    FLK(238, "Фолклендские (Мальвинские) острова", "Falkland Islands (Islas Malvinas)"), // Фолклендские
    // (Мальвинские)
    // острова
    FRA(250, "Франция", "France"), // Франция
    FRO(234, "Фарерские острова", "Faroe Islands"), // Фарерские
						    // острова
    FSM(583, "Микронезия", "Micronesia, Federated States of"), // Микронезия
    GAB(266, "Габон", "Gabon"), // Габон
    GBR(826, "Великобритания", "United Kingdom"), // Великобритания
    GEO(268, "Грузия", "Georgia"), // Грузия
    GGY(831, "Гернси", "Guernsey"), // Гернси
    GHA(288, "Гана", "Ghana"), // Гана
    GIB(292, "Гибралтар", "Gibraltar"), // Гибралтар
    GIN(324, "Гвинея", "Guinea"), // Гвинея
    GLP(312, "Гваделупа", "Guadeloupe"), // Гваделупа
    GMB(270, "Гамбия", "The Gambia"), // Гамбия
    GNB(624, "Гвинея-Бисау", "Guinea-Bissau"), // Гвинея-Бисау
    GNQ(226, "Экваториальная Гвинея", "Equatorial Guinea"), // Экваториальная
    // Гвинея
    GRC(300, "Греция", "Greece"), // Греция
    GRD(308, "Гренада", "Grenada"), // Гренада
    GRL(304, "Гренландия", "Greenland"), // Гренландия
    GTM(320, "Гватемала", "Guatemala"), // Гватемала
    GUF(254, "Французская Гвиана", "French Guiana"), // Французская
						     // Гвиана
    GUM(316, "Гуам", "Guam"), // Гуам
    GUY(328, "Гайана", "Guyana"), // Гайана
    HKG(344, "Гонконг", "Hong Kong"), // Гонконг
    HND(340, "Гондурас", "Honduras"), // Гондурас
    HRV(191, "Хорватия", "Croatia"), // Хорватия
    HTI(332, "Гаити", "Haiti"), // Гаити
    HUN(348, "Венгрия", "Hungary"), // Венгрия
    IDN(360, "Индонезия", "Indonesia"), // Индонезия
    IMN(833, "Остров Мэн", "Isle of Man"), // Остров Мэн
    IND(356, "Индия", "India"), // Индия
    IOT(86, "Британская территория в Индийском океане", "British Indian Ocean Territory"), // Британская
    // территория
    // в
    // Индийском
    // океане
    IRL(372, "Ирландия", "Ireland"), // Ирландия
    IRN(364, "Иран", "Iran"), // Иран
    IRQ(368, "Ирак", "Iraq"), // Ирак
    ISL(352, "Исландия", "Iceland"), // Исландия
    ISR(376, "Израиль", "Israel"), // Израиль
    ITA(380, "Италия", "Italy"), // Италия
    JAM(388, "Ямайка", "Jamaica"), // Ямайка
    JEY(832, "Джерси", "Jersey"), // Джерси
    JOR(400, "Иордания", "Jordan"), // Иордания
    JPN(392, "Япония", "Japan"), // Япония
    KAZ(398, "Казахстан", "Kazakhstan"), // Казахстан
    KEN(404, "Кения", "Kenya"), // Кения
    KGZ(417, "Киргизия", "Kyrgyzstan"), // Киргизия
    KHM(116, "Камбоджа", "Cambodia"), // Камбоджа
    KIR(296, "Кирибати", "Kiribati"), // Кирибати
    KNA(659, "Сент-Китс и Невис", "Saint Kitts and Nevis"), // Сент-Китс
							    // и
    // Невис
    KOR(410, "Южная Корея", "Korea, South"), // Южная Корея
    KWT(414, "Кувейт", "Kuwait"), // Кувейт
    LAO(418, "Лаос", "Laos"), // Лаос
    LBN(422, "Ливан", "Lebanon"), // Ливан
    LBR(430, "Либерия", "Liberia"), // Либерия
    LBY(434, "Ливия", "Libya"), // Ливия
    LCA(662, "Сент-Люсия", "Saint Lucia"), // Сент-Люсия
    LIE(438, "Лихтенштейн", "Liechtenstein"), // Лихтенштейн
    LKA(144, "Шри-Ланка", "Sri Lanka"), // Шри-Ланка
    LSO(426, "Лесото", "Lesotho"), // Лесото
    LTU(440, "Литва", "Lithuania"), // Литва
    LUX(442, "Люксембург", "Luxembourg"), // Люксембург
    LVA(428, "Латвия", "Latvia"), // Латвия
    MAC(446, "Макао", "Macau"), // Макао
    MAF(663, "Остров Святого Мартина", "Saint Martin"), // Остров
							// Святого
    // Мартина
    MAR(504, "Марокко", "Morocco"), // Марокко
    MCO(492, "Монако", "Monaco"), // Монако
    MDA(498, "Молдова", "Moldova"), // Молдова
    MDG(450, "Мадагаскар", "Madagascar"), // Мадагаскар
    MDV(462, "Мальдивы", "Maldives"), // Мальдивы
    MEX(484, "Мексика", "Mexico"), // Мексика
    MHL(584, "Маршалловы острова", "Marshall Islands"), // Маршалловы
    // острова
    MKD(807, "Республика Македония", "Macedonia"), // Республика
						   // Македония
    MLI(466, "Мали", "Mali"), // Мали
    MLT(470, "Мальта", "Malta"), // Мальта
    MMR(104, "Мьянма", "Burma"), // Мьянма
    MNE(499, "Черногория", "Montenegro"), // Черногория
    MNG(496, "Монголия", "Mongolia"), // Монголия
    MNP(580, "Северные Марианские острова", "Northern Mariana Islands"), // Северные
    // Марианские
    // острова
    MOZ(508, "Мозамбик", "Mozambique"), // Мозамбик
    MRT(478, "Мавритания", "Mauritania"), // Мавритания
    MSR(500, "Монтсеррат", "Montserrat"), // Монтсеррат
    MUS(480, "Маврикий", "Mauritius"), // Маврикий
    MWI(454, "Малави", "Malawi"), // Малави
    MYS(458, "Малайзия", "Malaysia"), // Малайзия
    MYT(175, "Майотта", "Mayotte"), // Майотта
    NAM(516, "Намибия", "Namibia"), // Намибия
    NCL(540, "Новая Каледония", "New Caledonia"), // Новая Каледония
    NER(562, "Нигер", "Niger"), // Нигер
    NFK(574, "Остров Норфолк", "Norfolk Island"), // Остров Норфолк
    NGA(566, "Нигерия", "Nigeria"), // Нигерия
    NIC(558, "Никарагуа", "Nicaragua"), // Никарагуа
    NIU(570, "Ниуэ", "Niue"), // Ниуэ
    NLD(528, "Нидерланды", "Netherlands"), // Нидерланды
    NOR(578, "Норвегия", "Norway"), // Норвегия
    NPL(524, "Непал", "Nepal"), // Непал
    NRU(520, "Науру", "Nauru"), // Науру
    NZL(554, "Новая Зеландия", "New Zealand"), // Новая Зеландия
    OMN(512, "Оман", "Oman"), // Оман
    PAK(586, "Пакистан", "Pakistan"), // Пакистан
    PAN(591, "Панама", "Panama"), // Панама
    PCN(612, "Питкерн", "Pitcairn"), // Питкерн
    PER(604, "Перу", "Peru"), // Перу
    PHL(608, "Филиппины", "Philippines"), // Филиппины
    PLW(585, "Палау", "Palau"), // Палау
    PNG(598, "Папуа-Новая Гвинея", "Papua New Guinea"), // Папуа-Новая
    // Гвинея
    POL(616, "Польша", "Poland"), // Польша
    PRI(630, "Пуэрто-Рико", "Puerto Rico"), // Пуэрто-Рико
    PRK(408, "Северная Корея (КНДР)", "Korea, North"), // Северная
						       // Корея
    // (КНДР)
    PRT(620, "Португалия", "Portugal"), // Португалия
    PRY(600, "Парагвай", "Paraguay"), // Парагвай
    PSE(275, "Оккупированная палестинская территория", "Palestinian Territory, Occupied"), // Оккупированная
    // палестинская
    // территория
    PYF(258, "Французская Полинезия", "French Polynesia"), // Французская
    // Полинезия
    QAT(634, "Катар", "Qatar"), // Катар
    REU(638, "Реюньон", "Reunion"), // Реюньон
    ROU(642, "Румыния", "Romania"), // Румыния
    RUS(643, "Россия (РФ)", "Russia"), // Россия (РФ)
    RWA(646, "Руанда", "Rwanda"), // Руанда
    SAU(682, "Саудовская Аравия", "Saudi Arabia"), // Саудовская
						   // Аравия
    SDN(736, "Судан", "Sudan"), // Судан
    SEN(686, "Сенегал", "Senegal"), // Сенегал
    SGP(702, "Сингапур", "Singapore"), // Сингапур
    SGS(239, "Южная Джорджия и Южные Сандвичевы острова", "South Georgia and the South Sandwich Islands"), // Южная
    // Джорджия
    // и
    // Южные
    // Сандвичевы
    // острова
    SHG_(-1, "SCHENGENER STAATEN", "SCHENGENER STAATEN"), // SCHENGENER
    // STAATEN
    SHN(654, "Святая Елена", "Saint Helena"), // Святая Елена
    SJM(744, "Шпицберген и Ян Майен", "Svalbard and Jan Mayen"), // Шпицберген
    // и Ян
    // Майен
    SLB(90, "Соломоновы острова", "Solomon Islands"), // Соломоновы
						      // острова
    SLE(694, "Сьерра-Леоне", "Sierra Leone"), // Сьерра-Леоне
    SLV(222, "Эль-Сальвадор", "El Salvador"), // Эль-Сальвадор
    SMR(674, "Сан-Марино", "San Marino"), // Сан-Марино
    SOM(706, "Сомали", "Somalia"), // Сомали
    SPM(666, "Сен-Пьер и Микелон", "Saint Pierre and Miquelon"), // Сен-Пьер
    // и
    // Микелон
    SRB(688, "Сербия", "Serbia"), // Сербия
    STP(678, "Сан-Томе и Принсипи", "Sao Tome and Principe"), // Сан-Томе
							      // и
    // Принсипи
    SUR(740, "Суринам", "Suriname"), // Суринам
    SVK(703, "Словакия", "Slovakia"), // Словакия
    SVN(705, "Словения", "Slovenia"), // Словения
    SWE(752, "Швеция", "Sweden"), // Швеция
    SWZ(748, "Свазиленд", "Swaziland"), // Свазиленд
    SYC(690, "Сейшелы", "Seychelles"), // Сейшелы
    SYR(760, "Сирия", "Syria"), // Сирия
    TCA(796, "Острова Тёркс и Кайкос", "Turks and Caicos Islands"), // Острова
    // Тёркс
    // и
    // Кайкос
    TCD(148, "Чад", "Chad"), // Чад
    TGO(768, "Того", "Togo"), // Того
    THA(764, "Таиланд", "Thailand"), // Таиланд
    TJK(762, "Таджикистан", "Tajikistan"), // Таджикистан
    TKM(795, "Туркмения", "Turkmenistan"), // Туркмения
    TLS(626, "Тимор-Лесте", "Timor-Leste"), // Тимор-Лесте
    TON(776, "Тонга", "Tonga"), // Тонга
    TTO(780, "Тринидад и Тобаго", "Trinidad and Tobago"), // Тринидад
							  // и
    // Тобаго
    TUN(788, "Тунис", "Tunisia"), // Тунис
    TUR(792, "Турция", "Turkey"), // Турция
    TUV(798, "Тувалу", "Tuvalu"), // Тувалу
    TWN(158, "Тайвань (Китай)", "Taiwan"), // Тайвань (Китай)
    TZA(834, "Танзания", "Tanzania"), // Танзания
    UGA(800, "Уганда", "Uganda"), // Уганда
    UKR(804, "Украина", "Ukraine"), // Украина
    URY(858, "Уругвай", "Uruguay"), // Уругвай
    USA(840, "Соединенные Штаты Америки (США)", "United States"), // Соединенные
    // Штаты
    // Америки
    // (США)
    UZB(860, "Узбекистан", "Uzbekistan"), // Узбекистан
    VAT(336, "Ватикан", "Holy See (Vatican City)"), // Ватикан
    VCT(670, "Сент-Винсент и Гренадины", "Saint Vincent and the Grenadines"), // Сент-Винсент
    // и
    // Гренадины
    VEN(862, "Венесуэла", "Venezuela"), // Венесуэла
    VGB(92, "Британские Виргинские острова", "British Virgin Islands"), // Британские
    // Виргинские
    // острова
    VIR(850, "Виргинские острова США", "Virgin Islands"), // Виргинские
    // острова США
    VNM(704, "Вьетнам", "Vietnam"), // Вьетнам
    VUT(548, "Вануату", "Vanuatu"), // Вануату
    WLF(876, "Уоллис и Футуна", "Wallis and Futuna"), // Уоллис и
						      // Футуна
    WSM(882, "Самоа", "Samoa"), // Самоа
    YEM(887, "Йемен", "Yemen"), // Йемен
    YUG(891, "Югославия", "Югославия"), // Югославия
    ZAF(710, "Южная Африка (ЮАР)", "South Africa"), // Южная Африка
						    // (ЮАР)
    ZMB(894, "Замбия", "Zambia"), // Замбия
    ZWE(716, "Зимбабве", "Zimbabwe"), // Зимбабве
    UNSPECIFIED(0, "", "");

    private final int isoCode;
    final String rusname;
    final String engname;

    Country2(int isoCode, String rusname, String engname) {
	this.isoCode = isoCode;
	this.rusname = rusname;
	this.engname = engname;
    }

    public static Country2 forISOCode(int isoCode) {
	for (Country2 c : Country2.values())
	    if (c.getIsoCode() == isoCode)
		return c;
	return null;
    }

    public static Country2 forISOCode(String isoCode) {
	try {
	    int i = Integer.parseInt(isoCode);
	    return forISOCode(i);
	} catch (NumberFormatException e) {
	    return null;
	}
    }

    // GENERATED

    public int getIsoCode() {
	return isoCode;
    }

}
